Repository: andreaseirich/tutorflow
Catalog: backend/locale/*/LC_MESSAGES/django.po
Languages: de

source: LLM_API_KEY is required when MOCK_LLM=0 (live mode disabled without key).
de: LLM_API_KEY ist erforderlich, wenn MOCK_LLM=0 (Live-Modus ohne Schlüssel deaktiviert).

source: LLM_API_KEY is not configured. Please set the LLM_API_KEY environment variable.
de: LLM_API_KEY ist nicht konfiguriert. Bitte setzen Sie die Umgebungsvariable LLM_API_KEY.

source: Unexpected error: max retries exceeded without error
de: Unerwarteter Fehler: Maximale Wiederholungen überschritten ohne Fehler

source: Mock mode is active, but no mock samples are available (key: {key}).
de: Mock-Modus ist aktiv, aber keine Mock-Beispiele verfügbar (Schlüssel: {key}).

source: Mock mode is disabled. Call generate_text() with real prompts instead.
de: Mock-Modus ist deaktiviert. Rufen Sie generate_text() stattdessen mit echten Prompts auf.

source: Mock mode is active, but no mock samples are available.
de: Mock-Modus ist aktiv, aber keine Mock-Beispiele verfügbar.

source: API rate limit exceeded. Please try again in a few minutes.
de: API-Rate-Limit überschritten. Bitte versuchen Sie es in ein paar Minuten erneut.

source: API rate limit exceeded: {details}
de: API-Rate-Limit überschritten: {details}

source: Invalid API key. Please check your LLM_API_KEY configuration.
de: Ungültiger API-Schlüssel. Bitte überprüfen Sie Ihre LLM_API_KEY-Konfiguration.

source: Invalid API key: {details}
de: Ungültiger API-Schlüssel: {details}

source: Payment required. Please check your API account balance.
de: Zahlung erforderlich. Bitte überprüfen Sie Ihr API-Kontoguthaben.

source: Payment required: {details}
de: Zahlung erforderlich: {details}

source: API error occurred
de: API-Fehler aufgetreten

source: API error ({type}): {message}
de: API-Fehler ({type}): {message}

source: API error: HTTP {status} - {details}
de: API-Fehler: HTTP {status} - {details}

source: Unexpected API response format
de: Unerwartetes API-Antwortformat

source: API timeout after {seconds} seconds
de: API-Timeout nach {seconds} Sekunden

source: API error: {error}
de: API-Fehler: {error}

source: Error parsing API response: {error}
de: Fehler beim Parsen der API-Antwort: {error}

source: LLM error: {error}
de: LLM-Fehler: {error}

source: Lesson plan for {date}
de: Lektionsplan für {date}

source: This function is only available for premium users.
de: Diese Funktion ist nur für Premium-Benutzer verfügbar.

source: Lesson plan successfully generated! Model: {model}
de: Lektionsplan erfolgreich generiert! Modell: {model}

source: The lesson plan could not be generated: {error}
de: Der Lektionsplan konnte nicht generiert werden: {error}

source: An unexpected error occurred: {error}. Please check the logs or try again later.
de: Ein unerwarteter Fehler ist aufgetreten: {error}. Bitte überprüfen Sie die Logs oder versuchen Sie es später erneut.

source: Contract
de: Vertrag

source: Payer Information
de: Zahlerinformationen

source: Period
de: Zeitraum

source: Amount
de: Betrag

source: Timestamps
de: Zeitstempel

source: Items
de: Posten

source: Student
de: Schüler

source: Start of the billing period
de: Beginn des Abrechnungszeitraums

source: Optional: Filter by contract (only lessons from this contract will be billed)
de: Optional: Nach Vertrag filtern (nur Unterrichtsstunden aus diesem Vertrag werden abgerechnet)

source: The end date must not be before the start date.
de: Das Enddatum darf nicht vor dem Startdatum liegen.

source: Draft
de: Entwurf

source: Sent
de: Versendet

source: Paid
de: Bezahlt

source: Name of the payer
de: Name des Zahlungspflichtigen

source: Address of the payer
de: Adresse des Zahlungspflichtigen

source: Associated contract (optional)
de: Zugehöriger Vertrag (optional)

source: Billing period start
de: Beginn des Abrechnungszeitraums

source: Billing period end
de: Ende des Abrechnungszeitraums

source: Invoice status
de: Status der Rechnung

source: Total invoice amount
de: Gesamtbetrag der Rechnung

source: Generated invoice document (HTML/PDF)
de: Generiertes Rechnungsdokument (HTML/PDF)

source: Invoice
de: Rechnung

source: Invoices
de: Rechnungen

source: Associated invoice
de: Zugehörige Rechnung

source: Associated lesson (may be deleted later)
de: Zugehörige Lesson (kann später gelöscht werden)

source: Item description
de: Beschreibung des Postens

source: Lesson date (copy)
de: Datum der Unterrichtsstunde (Kopie)

source: Duration in minutes (copy)
de: Dauer in Minuten (Kopie)

source: Amount for this item
de: Betrag für diesen Posten

source: Invoice Item
de: Rechnungsposten

source: Invoice Items
de: Rechnungsposten

source: No billable lessons found in the specified period.
de: Keine abrechenbaren Unterrichtsstunden im angegebenen Zeitraum gefunden.

source: Lesson {date} {time} - {student}
de: Unterrichtsstunde {date} {time} - {student}

source: Warning
de: Warnung

source: Do you really want to delete this invoice?
de: Möchten Sie diese Rechnung wirklich löschen?

source: Amount:
de: Betrag:

source: Number of Items:
de: Anzahl der Posten:

source: Note:
de: Hinweis:

source: All lessons in this invoice will be reset to 'taught' if they are not included in other invoices.
de: Alle Unterrichtsstunden in dieser Rechnung werden auf 'unterrichtet' zurückgesetzt, wenn sie nicht in anderen Rechnungen enthalten sind.

source: Yes, delete
de: Ja, löschen

source: Cancel
de: Abbrechen

source: All taught lessons (status 'taught') in the specified period will be automatically included in the invoice. Lessons with status 'planned' or 'paid' will not be considered. A lesson can only appear in one invoice - lessons that are already included in another invoice will be automatically excluded.
de: Alle unterrichteten Unterrichtsstunden (Status 'unterrichtet') im angegebenen Zeitraum werden automatisch in die Rechnung aufgenommen. Unterrichtsstunden mit Status 'geplant' oder 'bezahlt' werden nicht berücksichtigt. Eine Unterrichtsstunde kann nur in einer Rechnung erscheinen - Unterrichtsstunden, die bereits in einer anderen Rechnung enthalten sind, werden automatisch ausgeschlossen.

source: Period:
de: Zeitraum:

source: to
de: bis

source: If selected, only lessons from this contract will be billed.
de: Wenn ausgewählt, werden nur Unterrichtsstunden aus diesem Vertrag abgerechnet.

source: Show Preview
de: Vorschau anzeigen

source: Available Lesson (%(counter)s)
de: Verfügbare Unterrichtsstunde (%(counter)s)

source: These lessons will be automatically included in the invoice:
de: Diese Unterrichtsstunden werden automatisch in die Rechnung aufgenommen:

source: Date
de: Datum

source: Time
de: Zeit

source: Duration
de: Dauer

source: Make sure that:
de: Stellen Sie sicher, dass:

source: There are lessons with status 'taught' in the period
de: Es gibt Unterrichtsstunden mit Status 'unterrichtet' im Zeitraum

source: These lessons are not already included in another invoice
de: Diese Unterrichtsstunden sind nicht bereits in einer anderen Rechnung enthalten

source: Please enter a period.
de: Bitte geben Sie einen Zeitraum ein.

source: Back to List
de: Zurück zur Liste

source: Generate Document
de: Dokument generieren

source: View Document
de: Dokument anzeigen

source: Delete
de: Löschen

source: Payer
de: Zahler

source: Address
de: Adresse

source: Total:
de: Gesamt:

source: Invoice Number: %(id)s
de: Rechnungsnummer: %(id)s

source: Created with TutorFlow
de: Erstellt mit TutorFlow

source: Actions
de: Aktionen

source: Invoice {id} successfully created with {count} lesson.
de: Rechnung {id} erfolgreich erstellt mit {count} Unterrichtsstunde.

source: Invoice deleted. {count} lesson was reset to "taught".
de: Rechnung gelöscht. {count} Unterrichtsstunde wurde auf "unterrichtet" zurückgesetzt.

source: Invoice successfully deleted.
de: Rechnung erfolgreich gelöscht.

source: Invoice document successfully generated.
de: Rechnungsdokument erfolgreich generiert.

source: Error generating document: {error}
de: Fehler beim Generieren des Dokuments: {error}

source: Invoice document not found.
de: Rechnungsdokument nicht gefunden.

source: Invoice document file not found.
de: Rechnungsdokumentdatei nicht gefunden.

source: Recurrence
de: Wiederholung

source: Title of the blocked time (e.g., 'University lecture', 'Community')
de: Titel der Blockzeit (z.B. 'Universitätsvorlesung', 'Gemeinschaft')

source: Description of the blocked time
de: Beschreibung der Blockzeit

source: Start datetime
de: Startdatum/-zeit

source: End datetime
de: Enddatum/-zeit

source: Is this a recurring blocked time?
de: Ist dies eine wiederkehrende Blockzeit?

source: Recurrence pattern (e.g., 'weekly', 'daily') - for future extension
de: Wiederholungsmuster (z.B. 'wöchentlich', 'täglich') - für zukünftige Erweiterung

source: Blocked Time
de: Blockzeit

source: Blocked Times
de: Blockzeiten

source: Series start date
de: Serienstartdatum

source: Series end date (optional)
de: Serienenddatum (optional)

source: Start time
de: Startzeit

source: End time
de: Endzeit

source: Weekly
de: Wöchentlich

source: Bi-weekly
de: Zweiwöchentlich

source: Monthly
de: Monatlich

source: Recurrence type: Weekly, bi-weekly, or monthly
de: Wiederholungstyp: Wöchentlich, zweiwöchentlich oder monatlich

source: Monday
de: Montag

source: Tuesday
de: Dienstag

source: Wednesday
de: Mittwoch

source: Thursday
de: Donnerstag

source: Friday
de: Freitag

source: Saturday
de: Samstag

source: Sunday
de: Sonntag

source: Jump to date:
de: Zum Datum springen:

source: Mon
de: Mo

source: Tue
de: Di

source: Wed
de: Mi

source: Thu
de: Do

source: Fri
de: Fr

source: Sat
de: Sa

source: Sun
de: So

source: Is the series active?
de: Ist die Serie aktiv?

source: Recurring Blocked Time
de: Wiederkehrende Blockzeit

source: Recurring Blocked Times
de: Wiederkehrende Blockzeiten

source: Tu
de: Di

source: We
de: Mi

source: Th
de: Do

source: Su
de: So

source: None
de: Keine

source: Overlap with lesson for {student} ({time})
de: Überschneidung mit Unterrichtsstunde für {student} ({time})

source: Recurring blocked time successfully created.
de: Wiederkehrende Blockzeit erfolgreich erstellt.

source: Recurring blocked time successfully updated.
de: Wiederkehrende Blockzeit erfolgreich aktualisiert.

source: Recurring blocked time successfully deleted.
de: Wiederkehrende Blockzeit erfolgreich gelöscht.

source: {created} blocked time created, {skipped} skipped, {conflicts} conflict detected!
de: {created} Blockzeit erstellt, {skipped} übersprungen, {conflicts} Konflikt erkannt!

source: {created} blocked time successfully created, {skipped} skipped.
de: {created} Blockzeit erfolgreich erstellt, {skipped} übersprungen.

source: Are you sure you want to delete the blocked time "%(title)s" (%(datetime)s)?
de: Möchten Sie die Blockzeit "%(title)s" (%(datetime)s) wirklich löschen?

source: Confirm Delete
de: Löschen bestätigen

source: Edit
de: Bearbeiten

source: Title
de: Titel

source: End
de: Ende

source: Recurring
de: Wiederkehrend

source: Yes
de: Ja

source: No
de: Nein

source: Recurrence Pattern
de: Wiederholungsmuster

source: Last updated
de: Zuletzt aktualisiert

source: Save
de: Speichern

source: Are you sure you want to delete the recurring blocked time "%(title)s" (%(weekdays)s, %(time)s)?
de: Möchten Sie die wiederkehrende Blockzeit "%(title)s" (%(weekdays)s, %(time)s) wirklich löschen?

source: Already generated blocked times will not be deleted.
de: Bereits generierte Blockzeiten werden nicht gelöscht.

source: Weekdays
de: Wochentage

source: Start Date
de: Startdatum

source: Not set
de: Nicht gesetzt

source: Recurrence Type
de: Wiederholungstyp

source: Inactive
de: Inaktiv

source: This series would generate <strong>%(counter)s</strong> blocked time.
de: Diese Serie würde <strong>%(counter)s</strong> Blockzeit generieren.

source: %(date)s from %(start)s to %(end)s - %(title)s
de: %(date)s von %(start)s bis %(end)s - %(title)s

source: Generate blocked times from this series
de: Blockzeiten aus dieser Serie generieren

source: Note: Existing blocked times will be skipped.
de: Hinweis: Bereits vorhandene Blockzeiten werden übersprungen.

source: Recurring blocked times allow you to create repeating blocked times (e.g., 'every Tuesday 6-8 PM'). After saving, you can generate the blocked times for the specified period.
de: Wiederkehrende Blockzeiten ermöglichen es Ihnen, sich wiederholende Blockzeiten zu erstellen (z.B. 'jeden Dienstag 18-20 Uhr'). Nach dem Speichern können Sie die Blockzeiten für den angegebenen Zeitraum generieren.

source: Weekly:
de: Wöchentlich:

source: Every week on the selected weekdays.
de: Jede Woche an den ausgewählten Wochentagen.

source: Bi-weekly:
de: Zweiwöchentlich:

source: Every second week on the selected weekdays.
de: Jede zweite Woche an den ausgewählten Wochentagen.

source: Every month on the same calendar day (e.g., every 15th of the month), if that day is a selected weekday.
de: Jeden Monat am gleichen Kalendertag (z.B. jeden 15. des Monats), wenn dieser Tag ein ausgewählter Wochentag ist.

source: Generate Blocked Times from Series
de: Blockzeiten aus Serie generieren

source: Do you want to generate blocked times from the series "%(title)s"?
de: Möchten Sie Blockzeiten aus der Serie "%(title)s" generieren?

source: Blocked time successfully created.
de: Blockzeit erfolgreich erstellt.

source: Blocked time successfully updated.
de: Blockzeit erfolgreich aktualisiert.

source: Blocked time successfully deleted.
de: Blockzeit erfolgreich gelöscht.

source: Lessons
de: Unterrichtsstunden

source: Monthly planning with planned units
de: Monatliche Planung mit geplanten Einheiten

source: If checked, you must enter planned units for each month. If unchecked, no maximum number of units is planned.
de: Wenn aktiviert, müssen Sie geplante Einheiten für jeden Monat eingeben. Wenn deaktiviert, wird keine maximale Anzahl von Einheiten geplant.

source: Student for whom the contract applies
de: Schüler, für den der Vertrag gilt

source: Institute name (if applicable)
de: Name des Instituts (falls zutreffend)

source: Rate per unit in EUR
de: Satz pro Einheit in EUR

source: Duration of one unit in minutes
de: Dauer einer Einheit in Minuten

source: Contract start date
de: Vertragsstartdatum

source: Contract end date (optional, empty = unlimited)
de: Vertragsendedatum (optional, leer = unbegrenzt)

source: Is the contract active?
de: Ist der Vertrag aktiv?

source: If checked, monthly planning with planned units is required. If unchecked, no maximum number of units is planned.
de: Wenn aktiviert, ist eine monatliche Planung mit geplanten Einheiten erforderlich. Wenn deaktiviert, wird keine maximale Anzahl von Einheiten geplant.

source: Additional notes about the contract
de: Zusätzliche Notizen zum Vertrag

source: Contracts
de: Verträge

source: Associated contract
de: Zugehöriger Vertrag

source: Year
de: Jahr

source: Month (1-12)
de: Monat (1-12)

source: Planned units for this month
de: Geplante Einheiten für diesen Monat

source: Contract Monthly Plan
de: Vertragsmonatsplan

source: Contract Monthly Plans
de: Vertragsmonatspläne

source: Are you sure you want to delete the contract <strong>%(contract_str)s</strong>?
de: Möchten Sie den Vertrag <strong>%(contract_str)s</strong> wirklich löschen?

source: This action cannot be undone.
de: Diese Aktion kann nicht rückgängig gemacht werden.

source: All institutes
de: Alle Institute

source: Optional: Filter by institute (only lessons from contracts with this institute)
de: Optional: Nach Institut filtern (nur Unterrichtsstunden von Verträgen mit diesem Institut)

source: Institute (optional):
de: Institut (optional):

source: If selected, only lessons from contracts with this institute will be billed.
de: Bei Auswahl werden nur Unterrichtsstunden von Verträgen mit diesem Institut abgerechnet.

source: Institute
de: Institut

source: Rate
de: Satz

source: %(rate)s€ per unit
de: %(rate)s€ pro Einheit

source: Duration per unit
de: Dauer pro Einheit

source: %(minutes)s minutes
de: %(minutes)s Minuten

source: unlimited
de: unbegrenzt

source: Monthly Planning
de: Monatliche Planung

source: Enter the planned units for each month in the contract period.
de: Geben Sie die geplanten Einheiten für jeden Monat im Vertragszeitraum ein.

source: No monthly planning required. This contract has no maximum number of units planned.
de: Keine monatliche Planung erforderlich. Dieser Vertrag hat keine maximale Anzahl von geplanten Einheiten.

source: From
de: Von

source: To
de: Bis

source: Contract created. Please enter the planned units per month.
de: Vertrag erstellt. Bitte geben Sie die geplanten Einheiten pro Monat ein.

source: Contract successfully created.
de: Vertrag erfolgreich erstellt.

source: Contract successfully updated.
de: Vertrag erfolgreich aktualisiert.

source: Please correct the errors in the monthly planning.
de: Bitte korrigieren Sie die Fehler in der monatlichen Planung.

source: Contract successfully deleted.
de: Vertrag erfolgreich gelöscht.

source: Profile
de: Profil

source: N/A
de: N/V

source: User
de: Benutzer

source: Associated Django user
de: Zugehöriger Django-Benutzer

source: Does the user have premium access?
de: Hat der Benutzer Premium-Zugang?

source: Since when is the user a premium member?
de: Seit wann ist der Benutzer Premium-Mitglied?

source: User Profile
de: Benutzerprofil

source: User Profiles
de: Benutzerprofile

source: Students
de: Schüler

source: Calendar
de: Kalender

source: Income
de: Einnahmen

source: Logout
de: Abmelden

source: Login
de: Anmelden

source: Today's Lessons
de: Heutige Stunden

source: Conflicts
de: Konflikte

source: %(counter)s conflict
de: %(counter)s Konflikt

source: No lessons scheduled for today.
de: Keine Stunden für heute geplant.

source: Upcoming Lessons (7 days)
de: Nächste Stunden (7 Tage)

source: No upcoming lessons.
de: Keine kommenden Stunden.

source: Paid:
de: Ausgezahlt:

source: (%(counter)s lesson)
de: (%(counter)s Unterrichtsstunde)

source: %(counter)s conflict in upcoming lessons!
de: %(counter)s Konflikt in kommenden Unterrichtsstunden!

source: Income Overview
de: Einnahmenübersicht

source: Summary
de: Zusammenfassung

source: Planned vs. Actual
de: Geplant vs. Tatsächlich

source: Category
de: Kategorie

source: Planned
de: Geplant

source: Actual
de: Tatsächlich

source: Difference
de: Differenz

source: Units
de: Einheiten

source: Year Overview
de: Jahresübersicht

source: Year Summary
de: Jahreszusammenfassung

source: Monthly Breakdown
de: Monatsaufschlüsselung

source: January
de: Januar

source: February
de: Februar

source: March
de: März

source: May
de: Mai

source: June
de: Juni

source: July
de: Juli

source: October
de: Oktober

source: December
de: Dezember

source: Login to TutorFlow
de: Bei TutorFlow anmelden

source: Invalid username or password. Please try again.
de: Ungültiger Benutzername oder Passwort. Bitte versuchen Sie es erneut.

source: Username
de: Benutzername

source: Password
de: Passwort

source: Demo Logins
de: Demo-Anmeldungen

source: AI Metadata
de: KI-Metadaten

source: Student for whom the plan was created
de: Schüler, für den der Plan erstellt wurde

source: Associated lesson (optional)
de: Zugehörige Unterrichtsstunde (optional)

source: Topic of the lesson plan
de: Thema des Lektionsplans

source: Subject (e.g., 'Math', 'German')
de: Fach (z.B. 'Mathe', 'Deutsch')

source: AI-generated lesson plan (text)
de: KI-generierter Lektionsplan (Text)

source: Grade level (e.g., '10th grade')
de: Klassenstufe (z.B. '10. Klasse')

source: Planned duration in minutes
de: Geplante Dauer in Minuten

source: Used LLM model (e.g., 'gpt-4', 'claude-3')
de: Verwendetes LLM-Modell (z.B. 'gpt-4', 'claude-3')

source: Lesson Plan
de: Lektionsplan

source: Lesson Plans
de: Lektionspläne

source: Lesson Plan - %(date)s - %(student)s
de: Lektionsplan - %(date)s - %(student)s

source: Lesson Information
de: Unterrichtsstundeninformationen

source: Time overlap with another lesson
de: Zeitüberschneidung mit einer anderen Unterrichtsstunde

source: Topic:
de: Thema:

source: Subject:
de: Fach:

source: Grade Level:
de: Klassenstufe:

source: AI Lesson Plan
de: KI-Lektionsplan

source: A lesson plan has already been generated for this lesson. You can regenerate it below.
de: Für diese Unterrichtsstunde wurde bereits ein Lektionsplan generiert. Sie können ihn unten neu generieren.

source: Generate an AI-powered lesson plan for this lesson.
de: Einen KI-gestützten Lektionsplan für diese Unterrichtsstunde generieren.

source: Regenerate AI Lesson Plan
de: KI-Lektionsplan neu generieren

source: AI-powered lesson plan generation is only available for premium users.
de: Die KI-gestützte Lektionsplangenerierung ist nur für Premium-Benutzer verfügbar.

source: Schedule
de: Zeitplan

source: Travel Times
de: Fahrzeiten

source: Overlap with blocked time: {title}
de: Überschneidung mit Blockzeit: {title}

source: Create a recurring series instead of a single lesson
de: Eine wiederkehrende Serie anstelle einer einzelnen Unterrichtsstunde erstellen

source: Every 2 Weeks
de: Alle 2 Wochen

source: Repeat pattern
de: Wiederholungsmuster

source: When should the series end? (optional)
de: Wann soll die Serie enden? (optional)

source: Taught
de: Unterrichtet

source: Cancelled
de: Ausgefallen

source: Lesson date
de: Datum der Unterrichtsstunde

source: Duration in minutes
de: Dauer in Minuten

source: Lesson status
de: Status der Unterrichtsstunde

source: Travel time before in minutes
de: Fahrtzeit vorher in Minuten

source: Travel time after in minutes
de: Fahrtzeit nachher in Minuten

source: Notes for the lesson
de: Notizen zur Unterrichtsstunde

source: Lesson
de: Unterrichtsstunde

source: Contract quota exceeded: By the end of {month:02d}.{year}, {planned} units are planned, but {actual} hours are present/planned.
de: Vertragskontingent überschritten: Bis Ende {month:02d}.{year} sind {planned} Einheiten geplant, aber {actual} Stunden vorhanden/geplant.

source: At least one weekday must be selected.
de: Mindestens ein Wochentag muss ausgewählt werden.

source: Series end date (optional, empty = until contract end)
de: Serienenddatum (optional, leer = bis Vertragsende)

source: Notes for the series
de: Notizen zur Serie

source: Recurring Lesson
de: Wiederkehrende Unterrichtsstunde

source: Recurring Lessons
de: Wiederkehrende Unterrichtsstunden

source: Recurring lesson created and {count} lesson generated.
de: Wiederkehrende Unterrichtsstunde erstellt und {count} Unterrichtsstunde generiert.

source: {count} lesson with conflicts detected.
de: {count} Unterrichtsstunde mit Konflikten erkannt.

source: Recurring lesson successfully created.
de: Wiederkehrende Unterrichtsstunde erfolgreich erstellt.

source: Recurring lesson successfully updated.
de: Wiederkehrende Unterrichtsstunde erfolgreich aktualisiert.

source: Recurring lesson successfully deleted.
de: Wiederkehrende Unterrichtsstunde erfolgreich gelöscht.

source: {count} lesson successfully created.
de: {count} Unterrichtsstunde erfolgreich erstellt.

source: {count} lesson skipped (already exists).
de: {count} Unterrichtsstunde übersprungen (bereits vorhanden).

source: {count} lesson with conflicts detected. Please check the details.
de: {count} Unterrichtsstunde mit Konflikten erkannt. Bitte überprüfen Sie die Details.

source: Calendar %(month)s %(year)s
de: Kalender %(month)s %(year)s

source: Click on a day to create a new lesson. Click on an existing lesson to edit it.
de: Klicken Sie auf einen Tag, um eine neue Unterrichtsstunde zu erstellen. Klicken Sie auf eine vorhandene Unterrichtsstunde, um sie zu bearbeiten.

source: Add blocked time
de: Blockzeit hinzufügen

source: View/edit blocked time
de: Blockzeit anzeigen/bearbeiten

source: Legend:
de: Legende:

source: Lesson (clickable to edit)
de: Unterrichtsstunde (anklickbar zum Bearbeiten)
