Repository: andreaseirich/tutorflow
Catalog: backend/locale/*/LC_MESSAGES/django.po
Languages: de

source: Blocked Time (clickable to edit)
de: Blockzeit (anklickbar zum Bearbeiten)

source: Days (clickable to create)
de: Tage (anklickbar zum Erstellen)

source: Planned: %(planned)s units | Actual: %(actual)s units (%(month)s/%(year)s)
de: Geplant: %(planned)s Einheiten | Tatsächlich: %(actual)s Einheiten (%(month)s/%(year)s)

source: Are you sure you want to delete the lesson for "%(student)s" on %(date)s at %(time)s?
de: Möchten Sie die Unterrichtsstunde für "%(student)s" am %(date)s um %(time)s wirklich löschen?

source: Lesson %(date)s - %(student)s
de: Unterrichtsstunde %(date)s - %(student)s

source: Travel Times:
de: Fahrzeiten:

source: Before: %(before)s Min. | After: %(after)s Min.
de: Vorher: %(before)s Min. | Nachher: %(after)s Min.

source: Contract Quota Exceeded
de: Vertragskontingent überschritten

source: Planned: %(planned)s units | Actual: %(actual)s hours
de: Geplant: %(planned)s Einheiten | Tatsächlich: %(actual)s Stunden

source: This lesson exceeds the planned quota until the end of %(month)s.%(year)s. Catching up is allowed, but pre-work is not.
de: Diese Unterrichtsstunde überschreitet das geplante Kontingent bis Ende %(month)s.%(year)s. Nachholen ist erlaubt, Vorarbeiten jedoch nicht.

source: A lesson plan has already been generated for this lesson.
de: Für diese Unterrichtsstunde wurde bereits ein Lektionsplan generiert.

source: Latest Lesson Plan:
de: Neuester Lektionsplan:

source: New Lesson
de: Neue Stunde

source: Travel Time Before (minutes):
de: Fahrtzeit vorher (Minuten):

source: Travel Time After (minutes):
de: Fahrtzeit nachher (Minuten):

source: Recurrence (Optional)
de: Wiederholung (Optional)

source: Repeat pattern:
de: Wiederholungsmuster:

source: Weekdays:
de: Wochentage:

source: Month View
de: Monatsansicht

source: No lessons available.
de: Keine Stunden vorhanden.

source: Lessons %(month)s/%(year)s
de: Unterrichtsstunden %(month)s/%(year)s

source: Are you sure you want to delete the recurring lesson for "%(student)s" (%(weekdays)s, %(time)s)?
de: Möchten Sie die wiederkehrende Unterrichtsstunde für "%(student)s" (%(weekdays)s, %(time)s) wirklich löschen?

source: Already generated lessons will not be deleted.
de: Bereits generierte Unterrichtsstunden werden nicht gelöscht.

source: This series would generate <strong>%(counter)s</strong> lesson.
de: Diese Serie würde <strong>%(counter)s</strong> Unterrichtsstunde generieren.

source: %(date)s at %(time)s - %(student)s
de: %(date)s um %(time)s - %(student)s

source: Generate lessons from this series
de: Unterrichtsstunden aus dieser Serie generieren

source: Note: Existing lessons will be skipped.
de: Hinweis: Bereits vorhandene Unterrichtsstunden werden übersprungen.

source: Recurring lessons allow you to create repeating lessons (e.g., 'every Monday at 2 PM'). After saving, all lessons for the specified period will be automatically generated.
de: Wiederkehrende Unterrichtsstunden ermöglichen es Ihnen, sich wiederholende Unterrichtsstunden zu erstellen (z.B. 'jeden Montag um 14 Uhr'). Nach dem Speichern werden alle Unterrichtsstunden für den angegebenen Zeitraum automatisch generiert.

source: Save and Generate Lessons
de: Speichern und Unterrichtsstunden generieren

source: Week View
de: Wochenansicht

source: Previous Week
de: Vorige Woche

source: Next Week
de: Nächste Woche

source: Lessons and blocked times can be created by clicking in a time block; drag-to-create is not implemented.
de: Unterrichtsstunden und Blockzeiten können durch Klicken in einen Zeitblock erstellt werden; Drag-to-Create ist nicht implementiert.

source: Click to view lesson plan
de: Klicken, um Lektionsplan anzuzeigen

source: Conflict detected - Click for details
de: Konflikt erkannt - Klicken für Details

source: Create New Appointment
de: Neuen Termin erstellen

source: Tutoring Lesson
de: Nachhilfeunterricht

source: Blocked Time/Other Appointment
de: Blockzeit/anderer Termin

source: Create
de: Erstellen

source: Please select a recurrence pattern and at least one weekday.
de: Bitte wählen Sie ein Wiederholungsmuster und mindestens einen Wochentag aus.

source: Recurring lesson created and {count} lesson(s) generated.
de: Wiederkehrende Unterrichtsstunde erstellt und {count} Unterrichtsstunde(n) generiert.

source: Lesson created, but {count} conflict(s) detected!
de: Unterrichtsstunde erstellt, aber {count} Konflikt(e) erkannt!

source: Lesson successfully created.
de: Unterrichtsstunde erfolgreich erstellt.

source: Lesson updated, but {count} conflict(s) detected!
de: Unterrichtsstunde aktualisiert, aber {count} Konflikt(e) erkannt!

source: Lesson successfully updated.
de: Unterrichtsstunde erfolgreich aktualisiert.

source: Lesson successfully deleted.
de: Unterrichtsstunde erfolgreich gelöscht.

source: Personal Information
de: Persönliche Informationen

source: School Information
de: Schulinformationen

source: School name
de: Schulname

source: Grade/Level (e.g., '10th grade', 'Q1')
de: Klasse/Stufe (z.B. '10. Klasse', 'Q1')

source: Subjects (comma-separated, e.g., 'Math, German, English')
de: Fächer (kommagetrennt, z.B. 'Mathe, Deutsch, Englisch')

source: Additional notes about the student
de: Zusätzliche Notizen zum Schüler

source: Are you sure you want to delete <strong>%(name)s</strong>?
de: Möchten Sie <strong>%(name)s</strong> wirklich löschen?

source: First Name
de: Vorname

source: Last Name
de: Nachname

source: Phone
de: Telefon

source: School
de: Schule

source: Grade
de: Klasse

source: Subjects
de: Fächer

source: Student successfully created.
de: Schüler erfolgreich erstellt.

source: Student successfully updated.
de: Schüler erfolgreich aktualisiert.

source: Student successfully deleted.
de: Schüler erfolgreich gelöscht.

source: Book Lesson
de: Stunde buchen

source: Available Time Slots
de: Verfügbare Zeitslots

source: Click on available time slots to select them. You can select multiple consecutive slots (e.g., 13:30 and 14:30 = booking from 13:30 to 14:30).
de: Klicken Sie auf verfügbare Zeitslots, um sie auszuwählen. Sie können mehrere aufeinanderfolgende Slots auswählen (z.B. 13:30 und 14:30 = Buchung von 13:30 bis 14:30).

source: Selected:
de: Ausgewählt:

source: Book Selected Slots
de: Ausgewählte Slots buchen

source: Clear Selection
de: Auswahl löschen

source: Occupied
de: Belegt

source: No working hours configured for this day.
de: Keine Arbeitszeiten für diesen Tag konfiguriert.

source: Book lesson on
de: Stunde buchen am

source: from
de: von

source: Error booking lesson.
de: Fehler beim Buchen der Stunde.

source: Please select consecutive time slots only.
de: Bitte wählen Sie nur aufeinanderfolgende Zeitslots aus.

source: Please select at least one time slot.
de: Bitte wählen Sie mindestens einen Zeitslot aus.

source: All selected slots must be on the same day.
de: Alle ausgewählten Slots müssen am selben Tag sein.

source: Lesson successfully booked.
de: Stunde erfolgreich gebucht.

source: Time slot is already booked.
de: Zeitslot ist bereits gebucht.

source: Start time must be on a 30-minute interval.
de: Startzeit muss auf einem 30-Minuten-Intervall liegen.

source: End time must be on a 30-minute interval.
de: Endzeit muss auf einem 30-Minuten-Intervall liegen.

source: End time must be after start time.
de: Endzeit muss nach der Startzeit liegen.

source: Duration must be a multiple of 30 minutes.
de: Dauer muss ein Vielfaches von 30 Minuten sein.

source: Invalid end time format.
de: Ungültiges Endzeit-Format.

source: Bookings must be at least 30 minutes in advance. Past time slots cannot be booked.
de: Buchungen müssen mindestens 30 Minuten im Voraus erfolgen. Vergangene Zeitslots können nicht gebucht werden.

source: Book Recurring Lesson
de: Serientermin buchen

source: Start Date:
de: Startdatum:

source: End Time:
de: Endzeit:

source: Recurrence Type:
de: Wiederholungstyp:

source: End Date (optional):
de: Enddatum (optional):

source: Please fill in all required fields.
de: Bitte füllen Sie alle erforderlichen Felder aus.

source: Please select at least one weekday.
de: Bitte wählen Sie mindestens einen Wochentag aus.

source: Error booking recurring lesson.
de: Fehler beim Buchen des Serientermins.

source: Invalid end date format.
de: Ungültiges Enddatum-Format.

source: Recurring lesson series successfully created. {count} lesson(s) generated.
de: Serientermin-Serie erfolgreich erstellt. {count} Stunde(n) generiert.

source: Enter your name
de: Geben Sie Ihren Namen ein

source: Full Name
de: Vollständiger Name

source: e.g., Max Mustermann
de: z.B. Max Mustermann

source: Continue
de: Weiter

source: No student found with this name.
de: Kein Schüler mit diesem Namen gefunden.

source: Similar names found
de: Ähnliche Namen gefunden

source: Did you mean one of these?
de: Meinten Sie einen davon?

source: similar
de: ähnlich

source: Create new student
de: Neuen Schüler erstellen

source: Create New Student
de: Neuen Schüler erstellen

source: e.g., Math, German
de: z.B. Mathe, Deutsch

source: Leave empty if no institute
de: Leer lassen, wenn kein Institut

source: Subject
de: Fach

source: e.g., Math
de: z.B. Mathe

source: Additional notes for the lesson...
de: Zusätzliche Notizen zur Stunde...

source: Upload Documents
de: Dokumente hochladen

source: You can upload multiple files (PDF, DOC, DOCX, TXT, JPG, PNG, max 10 MB each)
de: Sie können mehrere Dateien hochladen (PDF, DOC, DOCX, TXT, JPG, PNG, max. 10 MB pro Datei)

source: Select Time Slot
de: Zeitslot auswählen

source: Continue to Confirm
de: Weiter zur Bestätigung

source: Confirm Booking
de: Buchung bestätigen

source: Confirm and Book
de: Bestätigen und buchen

source: Documents
de: Dokumente

source: file(s)
de: Datei(en)

source: Please complete all steps.
de: Bitte vervollständigen Sie alle Schritte.

source: Data
de: Daten

source: Time Slot
de: Zeitslot

source: Please enter a name.
de: Bitte geben Sie einen Namen ein.

source: First name and last name are required.
de: Vorname und Nachname sind erforderlich.

source: Student created successfully.
de: Schüler erfolgreich erstellt.

source: Student ID is required.
de: Schüler-ID ist erforderlich.

source: Student not found.
de: Schüler nicht gefunden.

source: Date and start time are required.
de: Datum und Startzeit sind erforderlich.

source: An error occurred: {error}
de: Ein Fehler ist aufgetreten: {error}

source: Please enter your name.
de: Bitte geben Sie Ihren Namen ein.

source: Error searching for student.
de: Fehler bei der Suche nach Schüler.

source: Error creating student.
de: Fehler beim Erstellen des Schülers.

source: Booking Link
de: Buchungslink

source: Use this link for all students. Students will enter their name and can book lessons.
de: Verwenden Sie diesen Link für alle Schüler. Schüler geben ihren Namen ein und können Stunden buchen.

source: Public Booking Link
de: Öffentlicher Buchungslink

source: Share this link with all students. They can enter their name and book lessons.
de: Teilen Sie diesen Link mit allen Schülern. Sie können ihren Namen eingeben und Stunden buchen.

source: Confirm
de: Bestätigen

source: tap to reschedule
de: tippen zum Verschieben

source: Booked
de: Gebucht

source: Loading...
de: Laden...

source: Confirm Reschedule
de: Umbuchung bestätigen

source: Reschedule: select a new time slot below.
de: Umbuchung: wählen Sie unten einen neuen Zeitslot.

source: Reschedule failed.
de: Umbuchung fehlgeschlagen.

source: Please select a new time slot.
de: Bitte wählen Sie einen neuen Zeitslot.

source: New time:
de: Neue Zeit:

source: Enter the code for
de: Code eingeben für

source: Save this code for next time
de: Merken Sie sich diesen Code für das nächste Mal

source: Server error
de: Serverfehler

source: Network error: Please check your internet connection.
de: Netzwerkfehler: Bitte überprüfen Sie Ihre Internetverbindung.

source: Booking code is required. Please go back and verify again.
de: Buchungscode erforderlich. Bitte gehen Sie zurück und verifizieren Sie erneut.

source: Lesson rescheduled successfully.
de: Stunde erfolgreich umgebucht.

source: Reschedule not possible. Please try again.
de: Umbuchung nicht möglich. Bitte versuchen Sie es erneut.

source: Language
de: Sprache

source: Page not found
de: Seite nicht gefunden

source: The page you are looking for does not exist.
de: Die gesuchte Seite existiert nicht.

source: Back to Home
de: Zurück zur Startseite

source: The requested resource was not found.
de: Die angeforderte Ressource wurde nicht gefunden.

source: Legal navigation
de: Rechtliche Navigation

source: Imprint
de: Impressum

source: Privacy Policy
de: Datenschutzerklärung

source: Terms of Service
de: Allgemeine Geschäftsbedingungen

source: About TutorFlow
de: Über TutorFlow

source: Legal placeholder – not legally binding yet.
de: Rechtlicher Platzhalter – noch nicht rechtsverbindlich.

source: Placeholder – not legally binding yet.
de: Platzhalter – noch nicht rechtsverbindlich.

source: Last updated: %(date)s
de: Letzte Aktualisierung: %(date)s

source: Detailed legal information will be provided here soon.
de: Detaillierte rechtliche Informationen folgen in Kürze.

source: Contact: [email coming soon]
de: Kontakt: [E-Mail folgt in Kürze]

source: Responsible according to §5 TMG
de: Verantwortlich gemäß §5 TMG

source: TutorFlow – Placeholder company name
de: TutorFlow – Platzhalter-Firmenname

source: Address follows here
de: Adresse folgt hier

source: Contact
de: Kontakt

source: Phone: [number coming soon]
de: Telefon: [Nummer folgt in Kürze]

source: Email: [email coming soon]
de: E-Mail: [E-Mail folgt in Kürze]

source: Editorial responsibility
de: Inhaltlich Verantwortlicher

source: Responsible person will be named here.
de: Verantwortliche Person wird hier benannt.

source: 1. General information
de: 1. Allgemeine Hinweise

source: This section will describe how TutorFlow handles personal data.
de: Dieser Abschnitt beschreibt künftig, wie TutorFlow personenbezogene Daten verarbeitet.

source: 2. Data we process
de: 2. Daten, die wir verarbeiten

source: Overview of categories (students, contracts, lessons) will be added here.
de: Eine Übersicht der Kategorien (Schüler, Verträge, Unterrichtsstunden) wird hier ergänzt.

source: 3. Rights of users
de: 3. Rechte der Nutzer

source: Information about access, rectification and deletion rights will be provided.
de: Informationen zu Auskunfts-, Berichtigungs- und Löschrechten folgen.

source: 1. Scope
de: 1. Geltungsbereich

source: TutorFlow usage guidelines will be defined in this section.
de: Anwendungsrichtlinien für TutorFlow werden in diesem Abschnitt definiert.

source: 2. Services of TutorFlow
de: 2. Leistungen von TutorFlow

source: Details about features and responsibilities will follow.
de: Details zu Funktionen und Verantwortlichkeiten folgen.

source: 3. Liability
de: 3. Haftung

source: Liability clauses and limitations will be outlined here.
de: Haftungsregelungen und Beschränkungen werden hier ausgeführt.

source: Our mission
de: Unsere Mission

source: TutorFlow helps tutors manage lessons, contracts and billing efficiently.
de: TutorFlow hilft Nachhilfelehrern, Unterricht, Verträge und Abrechnung effizient zu verwalten.

source: TutorFlow is currently in hackathon/demo mode. Detailed company information will follow.
de: TutorFlow befindet sich derzeit im Hackathon-/Demo-Modus. Detaillierte Unternehmensinformationen folgen.

source: Registration failed. Please try a different username or contact support.
de: Registrierung fehlgeschlagen. Bitte einen anderen Benutzernamen versuchen oder den Support kontaktieren.

source: Password confirmation
de: Passwort bestätigen

source: Register
de: Registrieren

source: Already have an account? Log in
de: Bereits ein Konto? Anmelden

source: Please correct the errors below.
de: Bitte korrigieren Sie die Fehler unten.
